
[
    {
      "images": "https://i.ibb.co/s3SB6fQ/drill-p10.jpg",
      "price": 101,
      "minOrder": 100,
      "availableQuan": 3570,
      "toolsName": "Professional Electric Drill Machine",
      "desc": "You can also perform various cutting operations such as boring, reaming, and taping. This drilling machine is capable of drilling holes up to 12.5 mm diameter in steel. And, it is widely used by woodworkers and manufacturing industries.\r\n"
    },
    {
      "images": "https://i.ibb.co/bFbf98P/drill-p9.jpg",
      "price": 120,
      "minOrder": 130,
      "availableQuan": 3211,
      "toolsName": " Small Drill Chuck",
      "desc": "It is also called a sensitive drilling machine, due to the ability which this machine provides. The ability to sense the progress of the drill with your hand during the drilling operation.\r\n"
    },
    {
      "images": "https://i.ibb.co/DtDcWgC/drill-p8.jpg",
      "price": 42,
      "minOrder": 160,
      "availableQuan": 2806,
      "toolsName": "Super 700Watt Electric Drill Machine",
      "desc": "This is a special-purpose machine tool in which the drill head consists of numerous spindles driven by a single motor. It is commonly used in manufacturing shops to drill multiple holes together at the same time. \r\n"
    },
    {
      "images": "https://i.ibb.co/njdsPJM/drill-p7.jpg",
      "price": 49,
      "minOrder": 140,
      "availableQuan": 4709,
      "toolsName": "  Professional Electric Drill Machine",
      "desc": "Now that you know your options for the best drilling machines, there’s only one question left to answer: Which type of drilling machine is right for you?    Pick the machine that best matches your needs and go drill something big or small.\r\n"
    },
    {
      "images": "https://i.ibb.co/QPRjDzP/drill-p5.jpg",
      "price": 65,
      "minOrder": 115,
      "availableQuan": 4868,
      "toolsName": " Total electric Drill Machin",
      "desc": "This is a special-purpose machine tool in which the drill head consists of numerous spindles driven by a single motor. It is commonly used in manufacturing shops to drill multiple holes together at the same time.  \r\n"
    },
    {
      "images": "https://i.ibb.co/fdfqRjN/drill-p3.jpg",
      "price": 50,
      "minOrder": 130,
      "availableQuan": 2493,
      "toolsName": "  Micro Twist Drill Chuck mini Drill Bi",
      "desc": "It is mainly used for drilling holes in a workpiece successively. Various machining operations like drilling, reaming, counter drilling, tapping can be performed using this machine.\r\n"
    },
    {
      "images": "https://i.ibb.co/bFbf98P/drill-p9.jpg",
      "price": 37,
      "minOrder": 150,
      "availableQuan": 4099,
      "toolsName": " 26-28mm 5000W German Boray",
      "desc": "This is a machine in which the drilling head is mounted to slide along a radial arm which can be rotated, raised, or lowered on a vertical pillar to adjust the position of the drill bit above the workpiece.\r\n"
    },
    {
      "images": "https://i.ibb.co/qFwv6MV/drill-p1.jpg",
      "price": 102,
      "minOrder": 110,
      "availableQuan": 3875,
      "toolsName": "Drill Machine Set 100 Pcs",
      "desc": "This machine is primarily used by professional woodworkers and manufacturing industries. Pillar Drilling Machine is suitable for drilling, reaming, reaming, tapping screws, spot-facing machining, and batch production.\r\n"
    },
    {
      "images": "https://i.ibb.co/bFbf98P/drill-p9.jpg",
      "price": 116,
      "minOrder": 100,
      "availableQuan": 2272,
      "toolsName": "1x Mailtank Cordless Drill, Stand",
      "desc": "Also known as an upright drilling machine, a pillar drill machine is an advanced drill machine used for making 20mm to 40mm holes in metal and wood. It looks similar to a bench drill machine. But it has a more powerful motor and more drilling capacity compared to a bench drill machine.\r\n"
    },
    {
      "images": "https://i.ibb.co/bFbf98P/drill-p9.jpg",
      "price": 91,
      "minOrder": 100,
      "availableQuan": 3882,
      "toolsName": "Drill Machine Set 120Pieces",
      "desc": "It is also called a sensitive drilling machine, due to the ability which this machine provides. The ability to sense the progress of the drill with your hand during the drilling operation.\r\n"
    },
    {
      "images": "https://i.ibb.co/fdfqRjN/drill-p3.jpg",
      "price": 108,
      "minOrder": 150,
      "availableQuan": 2903,
      "toolsName": "Puller for Ceiling Fan Bearing",
      "desc": "This is a bench-type drill machine used for making holes in wood and metals. You can also perform various cutting operations such as boring, reaming, and taping. This drilling machine is capable of drilling holes up to 12.5 mm diameter in steel. And, it is widely used by woodworkers and manufacturing industries.\r\n"
    },
    {
      "images": "https://i.ibb.co/njdsPJM/drill-p7.jpg",
      "price": 75,
      "minOrder": 140,
      "availableQuan": 3457,
      "toolsName": "Small Drill Chuck",
      "desc": "A portable drilling machine is a small-size, hand-operated power drill, mainly used for making small holes up to 12mm in an object in any position. It can drill a hole through woods, plastic, metal, and concrete. Due to their small size and mobility, portable drill machines are used by woodworkers, house owners, plumbers, electricians, and industrial workers.\r\n"
    },
    {
      "images": "https://i.ibb.co/fdfqRjN/drill-p3.jpg",
      "price": 99,
      "minOrder": 110,
      "availableQuan": 4311,
      "toolsName": "Corded Drill Machine",
      "desc": "t encloses all the mechanism for driving the drill at a different speed and feeds. In lighter machines, the driving motor is mounted at the rear end of the head counterbalancing the weight of the drill spindle.\r\n"
    },
    {
      "images": "https://i.ibb.co/s3SB6fQ/drill-p10.jpg",
      "price": 66,
      "minOrder": 150,
      "availableQuan": 3417,
      "toolsName": "Cordless Drill Machin",
      "desc": "It is mounted on the redial arm and drives the drill spindle. In some of the drill machines, the drill head may be adjusted up or down for accommodating different heights of the work in addition to the table adjustment.\r\n"
    },
    {
      "images": "https://i.ibb.co/fdfqRjN/drill-p3.jpg",
      "price": 59,
      "minOrder": 80,
      "availableQuan": 2617,
      "toolsName": "Hammer Drill Machin",
      "desc": "It is mounted on the column and extends horizontally over the base. It has guideways on which drill head slides. The radial arm moves around the column.\r\n"
    },
    {
      "images": "https://i.ibb.co/qFwv6MV/drill-p1.jpg",
      "price": 42,
      "minOrder": 85,
      "availableQuan": 3404,
      "toolsName": "1000W Impact Drill Machine KINGSAY",
      "desc": "The base is that part of the machine on which the verticle column is mounted. The base is made of casting. A base supports the column and worktable with other attachments.\r\n"
    }
  ]